updated readme with images and mermaid
